### 데이터프레임의 결합
- 유니언 결합
    - 가장 단순한 결합의 형태
    - 단순하게 행을 결합, 열을 결합
- 조인 결합
    - 특정한 조건에 맞춰서 데이터들을 열 결합
    - 데이터프레임 + 데이터프레임 결합 -> 특정 컬럼의 데이터들이 같은 값들로 이루어져있을때 열을 추가

In [ ]:
import pandas as pd

In [ ]:
data = {
    'name' : ['test', 'test2', 'test3'], 
    'age' : [20, 30, 40]
}
df1 = pd.DataFrame(data)
df1

In [ ]:
data2 = {
    'name' : ['test4', 'test5'], 
    'loc' : ['seoul', 'busan']
}
df2 = pd.DataFrame(data2)
df2

In [ ]:
# 단순하게 행을 결합
# pandas 안에 있는 concat([데이터프레임1, 데이터프레임2, ...], axis={0|1, rows|columns}, ignore_index={bool})
# axis 매개변수 : 행결합이냐 열결합을 지정
# ignore_index 매개변수 : 기본값은 False, 행을 결합할때 인덱스를 초기화 할것인가?, 열을 결합할때는 컬럼을 초기화 할것인가?를 지정

pd.concat([df1, df2], axis=0, ignore_index=True)

In [ ]:
pd.concat([df1, df2], axis=0).reset_index(drop=True)

In [ ]:
pd.concat([df1, df2], axis=1)

In [ ]:
df2.index = [5, 6]
df2

In [ ]:

pd.concat([df1, df2], axis=1, ignore_index= True)

In [ ]:
data3 = {
    'name' : ['test6', 'test7'], 
    'age' : [25, 35], 
    'loc' : ['ulsan', 'mokpo']
}
df3 = pd.DataFrame(data3)
df3

In [ ]:
# 3개의 데이터프레임을 행 결합 
pd.concat([df1, df2, df3], axis=0)

In [ ]:
# 특정한 조건에 맞춰서 열 결합 : 조인 결합
# pandas 안에 있는 merge()
# merge(데이터프레임1, 데이터프레임2, on = {컬럼명(조건)}, how = {left | right | inner | outer})

In [ ]:
data = {
    'id' : ['test', 'test2', 'test3', 'test4'], 
    'item' : ['A', 'B', 'A', 'D']
}
df1 = pd.DataFrame(data)
df1

In [22]:
data2 = {
    'item_name' : ['A', 'B', 'C'], 
    'price' : [100, 200, 300]
}
df2 = pd.DataFrame(data2)
df2

  item_name  price
0         A    100
1         B    200
2         C    300

In [ ]:
# 데이터프레임에서 조건 컬럼의 이름이 같은 경우
pd.merge(df1, df2 , on='item', how='outer')

In [24]:
# 데이터프레임에서 조건 컬럼의 이름이 다른 경우 
pd.merge(df1, df2, left_on='item', right_on='item_name', how='left')

      id item item_name  price
0   test    A         A  100.0
1  test2    B         B  200.0
2  test3    A         A  100.0
3  test4    D       NaN    NaN

In [25]:
data3 = {
    'id' : ['test', 'test2', 'test3'], 
    'gold' : [10000, 5000, 0]
}
df3 = pd.DataFrame(data3)
df3

      id   gold
0   test  10000
1  test2   5000
2  test3      0

In [27]:
# df1, df2, df3 모두 조인 결합
# df2의 컬럼의 이름을 변경 
df2.rename(columns={
    'item_name' : 'item'
}, inplace=True)

In [29]:
merge_data = pd.merge(df1, df2, on='item', how = 'left')
merge_data

      id item  price
0   test    A  100.0
1  test2    B  200.0
2  test3    A  100.0
3  test4    D    NaN

In [30]:
df3

      id   gold
0   test  10000
1  test2   5000
2  test3      0

In [31]:
pd.merge(merge_data, df3, on='id', how='left')

      id item  price     gold
0   test    A  100.0  10000.0
1  test2    B  200.0   5000.0
2  test3    A  100.0      0.0
3  test4    D    NaN      NaN